[Killed] BlockStatement
lambda-unit-testing-workshop/src/fetchCustomers/index.ts:16:95
   pageNumber: string
 }
 
-const fetchCustomers = async (event: APIGatewayProxyEvent): Promise<APIGatewayProxyResult> => {
-  const queryParams = event.queryStringParameters as QueryParams;
-  const limit = queryParams.limit || '5'
-  const pageNumber = queryParams.pageNumber || '1' 
-  
-  logger('DEBUG','invoked with query params', queryParams)
-  
-  const params = { limit, pageNumber }
-  
-  const baseUrl = process.env.baseUrl;
-  const url = `${baseUrl}/customers`
-
-  const customer = await axios.get(url, { params })
-
-  return {
-    statusCode: 200,
-    body: JSON.stringify(customer)
-  }
-}
+const fetchCustomers = async (event: APIGatewayProxyEvent): Promise<APIGatewayProxyResult> => {}
 
 const handler = middy(fetchCustomers)

[Killed] ConditionalExpression
lambda-unit-testing-workshop/src/fetchCustomers/index.ts:18:17
 
 const fetchCustomers = async (event: APIGatewayProxyEvent): Promise<APIGatewayProxyResult> => {
   const queryParams = event.queryStringParameters as QueryParams;
-  const limit = queryParams.limit || '5'
+  const limit = false
   const pageNumber = queryParams.pageNumber || '1' 
   

[Killed] LogicalOperator
lambda-unit-testing-workshop/src/fetchCustomers/index.ts:18:17
 
 const fetchCustomers = async (event: APIGatewayProxyEvent): Promise<APIGatewayProxyResult> => {
   const queryParams = event.queryStringParameters as QueryParams;
-  const limit = queryParams.limit || '5'
+  const limit = queryParams.limit && '5'
   const pageNumber = queryParams.pageNumber || '1' 
   

[Killed] ConditionalExpression
lambda-unit-testing-workshop/src/fetchCustomers/index.ts:19:22
 const fetchCustomers = async (event: APIGatewayProxyEvent): Promise<APIGatewayProxyResult> => {
   const queryParams = event.queryStringParameters as QueryParams;
   const limit = queryParams.limit || '5'
-  const pageNumber = queryParams.pageNumber || '1' 
+  const pageNumber = true 
   
   logger('DEBUG','invoked with query params', queryParams)

[Killed] LogicalOperator
lambda-unit-testing-workshop/src/fetchCustomers/index.ts:19:22
 const fetchCustomers = async (event: APIGatewayProxyEvent): Promise<APIGatewayProxyResult> => {
   const queryParams = event.queryStringParameters as QueryParams;
   const limit = queryParams.limit || '5'
-  const pageNumber = queryParams.pageNumber || '1' 
+  const pageNumber = queryParams.pageNumber && '1' 
   
   logger('DEBUG','invoked with query params', queryParams)

[Killed] StringLiteral
lambda-unit-testing-workshop/src/fetchCustomers/index.ts:21:18
   const limit = queryParams.limit || '5'
   const pageNumber = queryParams.pageNumber || '1' 
   
-  logger('DEBUG','invoked with query params', queryParams)
+  logger('DEBUG',"", queryParams)
   
   const params = { limit, pageNumber }

[Killed] ObjectLiteral
lambda-unit-testing-workshop/src/fetchCustomers/index.ts:30:10
 
   const customer = await axios.get(url, { params })
 
-  return {
-    statusCode: 200,
-    body: JSON.stringify(customer)
-  }
+  return {}
 }
 

[Killed] ObjectLiteral
lambda-unit-testing-workshop/src/fetchCustomers/index.ts:39:18
 const handler = middy(fetchCustomers)
   .use(jsonBodyParser()) 
   .use(httpErrorHandler())
-  .use(validator({ inputSchema }))
+  .use(validator({}))
 
 export {
