[Killed] ObjectLiteral
lambda-unit-testing-workshop/src/fetchCustomers/schema.ts:1:16
-export default {
-  type: 'object',
-  properties: {
-    queryStringParameters: {
-      type: 'object',
-      properties: {
-        limit: { type: 'integer', maximum: 10, minimum: 1 },
-        pageNumber: { type: 'integer', minimum:  1},
-      },
-    }
-  }
-}
+export default {}

[Killed] ObjectLiteral
lambda-unit-testing-workshop/src/fetchCustomers/schema.ts:7:16
     queryStringParameters: {
       type: 'object',
       properties: {
-        limit: { type: 'integer', maximum: 10, minimum: 1 },
+        limit: {},
         pageNumber: { type: 'integer', minimum:  1},
       },
