[Killed] BlockStatement
lambda-unit-testing-workshop/src/logger/index.ts:1:66
-export default (level: 'DEBUG' | 'ERROR', ...messages: any[]) => {
-  console.log(level, ...messages)
-}
+export default (level: 'DEBUG' | 'ERROR', ...messages: any[]) => {}
