[Killed] BlockStatement
lambda-unit-testing-workshop/src/saveCustomer/index.ts:20:93
   }
 }
 
-const saveCustomer = async (event: APIGatewayProxyEvent): Promise<APIGatewayProxyResult> => {
-  const customer = JSON.parse(event.body as string) as Customer;
-  const TableName = process.env.CUSTOMER_TABLE_NAME;
-  
-  if(!TableName) {
-    logger('DEBUG', 'Customer not saved to dynamo', customer)
-    throw new Error('CUSTOMER_TABLE_NAME env var not set')
-  }
-
-  const dynamoDB = new DocumentClient()
-  await dynamoDB.put({
-    TableName,
-    Item: { ...customer }
-  }).promise()
-
-  logger('DEBUG', 'Customer saved to dynamo', customer)
-
-  return {
-    statusCode: 200,
-    body: JSON.stringify(customer),
-  }
-}
+const saveCustomer = async (event: APIGatewayProxyEvent): Promise<APIGatewayProxyResult> => {}
 
 const handler = middy(saveCustomer)

[Killed] BooleanLiteral
lambda-unit-testing-workshop/src/saveCustomer/index.ts:24:6
   const customer = JSON.parse(event.body as string) as Customer;
   const TableName = process.env.CUSTOMER_TABLE_NAME;
   
-  if(!TableName) {
+  if(TableName) {
     logger('DEBUG', 'Customer not saved to dynamo', customer)
     throw new Error('CUSTOMER_TABLE_NAME env var not set')

[Killed] ConditionalExpression
lambda-unit-testing-workshop/src/saveCustomer/index.ts:24:6
   const customer = JSON.parse(event.body as string) as Customer;
   const TableName = process.env.CUSTOMER_TABLE_NAME;
   
-  if(!TableName) {
+  if(true) {
     logger('DEBUG', 'Customer not saved to dynamo', customer)
     throw new Error('CUSTOMER_TABLE_NAME env var not set')

[Survived] StringLiteral
lambda-unit-testing-workshop/src/saveCustomer/index.ts:26:21
   
   if(!TableName) {
     logger('DEBUG', 'Customer not saved to dynamo', customer)
-    throw new Error('CUSTOMER_TABLE_NAME env var not set')
+    throw new Error("")
   }
 

[Survived] StringLiteral
lambda-unit-testing-workshop/src/saveCustomer/index.ts:35:19
     Item: { ...customer }
   }).promise()
 
-  logger('DEBUG', 'Customer saved to dynamo', customer)
+  logger('DEBUG', "", customer)
 
   return {

[Survived] StringLiteral
lambda-unit-testing-workshop/src/saveCustomer/index.ts:35:10
     Item: { ...customer }
   }).promise()
 
-  logger('DEBUG', 'Customer saved to dynamo', customer)
+  logger("", 'Customer saved to dynamo', customer)
 
   return {
