[Survived] ObjectLiteral
lambda-unit-testing-workshop/src/saveCustomer/schema.ts:4:28
 export default {
   type: 'object',
   properties: {
-    queryStringParameters: {
-      type: 'object',
-      properties: {
-        limit: { type: 'integer', maximum: 10, minimum: 1 },
-        pageNumber: { type: 'integer', minimum:  1},
-      },
-    }
+    queryStringParameters: {}
   }
 }

[Survived] ObjectLiteral
lambda-unit-testing-workshop/src/saveCustomer/schema.ts:6:19
   properties: {
     queryStringParameters: {
       type: 'object',
-      properties: {
-        limit: { type: 'integer', maximum: 10, minimum: 1 },
-        pageNumber: { type: 'integer', minimum:  1},
-      },
+      properties: {},
     }
   }

[Survived] ObjectLiteral
lambda-unit-testing-workshop/src/saveCustomer/schema.ts:8:21
       type: 'object',
       properties: {
         limit: { type: 'integer', maximum: 10, minimum: 1 },
-        pageNumber: { type: 'integer', minimum:  1},
+        pageNumber: {},
       },
     }
